000001******************************************************************
000002******************************************************************
000003* Author. David Hernández Martín
000004* Date.   09042020
000005******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
       DISPLAY 'Hello DIVISION'.
           STOP RUN.
       END PROGRAM HELLO-WORLD.