      * MI PRIMER PROGRAMA EN COBOL
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HOLAMUNDO.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           DISPLAY "hola mundo".
           STOP "press any key".
       STOP RUN.
