       IDENTIFICATION DIVISION.
       PROGRAM-ID. 03-IO.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
           WORKING-STORAGE SECTION.
           77 WKS-NOMBRE PICTURE A(30).

       PROCEDURE DIVISION.
           DISPLAY "INTRODUCE TU NOMBRE: ".
           ACCEPT WKS-NOMBRE.
           DISPLAY "HOLA " WKS-NOMBRE.
           STOP "PRESS ANY KEY TO CONTINUE".
       STOP RUN.    
       END PROGRAM 03-IO.
       