       IDENTIFICATION DIVISION.
            PROGRAM-ID. 06-CONDICIONES.
       
       ENVIRONMENT DIVISION.
       DATA DIVISION.
         WORKING-STORAGE SECTION.

         77 WKS-NUM-1    PIC S9(05)V99.
         77 WKS-NUM-2    PIC S9(05)V99.
         77 WKS-RES      PIC S9(10)V99.
         77 WKS-OPCION   PIC A(03).
         77 WKS-ELECCION PIC 9(01).

       PROCEDURE DIVISION.
       00001-MI-SECCION SECTION.
       00001-MAIN.
           
           PERFORM 00000-CALCULADORA UNTIL WKS-ELECCION = 2.

       STOP RUN.

       00000-CALCULADORA.
           DISPLAY "1-. USAR LA CALCULADORA, 2-. SALIR".
           ACCEPT WKS-ELECCION.

           IF WKS-ELECCION = 1
             PERFORM 00001-PEDIR-DATOS
             PERFORM 00002-EJECUTAR-OPERACION
           ELSE IF WKS-ELECCION = 2
              NEXT SENTENCE
           ELSE
             DISPLAY "OPCION INCORRECTA".  
 
       00001-PEDIR-DATOS.
           DISPLAY "CALCULADORA".
           DISPLAY "DAME EL NUMERO 1:".
           ACCEPT WKS-NUM-1.
           DISPLAY "DAME EL NUMERO 2:".
           ACCEPT WKS-NUM-2.

           DISPLAY "SELECCIONA OPERACION: S = SUMA, R: RESTA, "
      -    "M:MULTIPLICAR, D:DIVISION".
           ACCEPT WKS-OPCION.

       00002-EJECUTAR-OPERACION.
           IF WKS-OPCION = "S"
             ADD WKS-NUM-1 TO WKS-NUM-2 GIVING WKS-RES
             DISPLAY WKS-NUM-1 " + " WKS-NUM-2 " = " WKS-RES
           ELSE IF WKS-OPCION = "R"
             SUBTRACT WKS-NUM-2 FROM WKS-NUM-1 GIVING WKS-RES
             DISPLAY WKS-NUM-1 " - " WKS-NUM-2 " = " WKS-RES
           ELSE IF WKS-OPCION = "M"
             MULTIPLY WKS-NUM-1 BY WKS-NUM-2 GIVING WKS-RES
             DISPLAY WKS-NUM-1 " x " WKS-NUM-2 " = " WKS-RES
           ELSE IF WKS-OPCION = "D"
             DIVIDE WKS-NUM-1 BY WKS-NUM-2 GIVING WKS-RES
             DISPLAY WKS-NUM-1 " / " WKS-NUM-2 " = " WKS-RES
           ELSE
             DISPLAY "OPERACION NO VALIDA".

       END PROGRAM 06-CONDICIONES.
